#### 📖 Terraform Plan ('infra-pe/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.key_vaults.azurerm_key_vault.cgn-pe will be created
  + resource "azurerm_key_vault" "cgn-pe" {
      + access_policy                 = (known after apply)
      + enable_rbac_authorization     = true
      + enabled_for_disk_encryption   = true
      + id                            = (known after apply)
      + location                      = "italynorth"
      + name                          = "io-p-itn-cgn-pe-kv-01"
      + public_network_access_enabled = true
      + purge_protection_enabled      = true
      + resource_group_name           = "io-p-itn-cgn-pe-rg-01"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 90
      + tags                          = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
      + tenant_id                     = "7788edaf-0346-4068-9d79-c868aed15b3d"
      + vault_uri                     = (known after apply)

      + network_acls {
          + bypass         = "AzureServices"
          + default_action = "Allow"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.networking.module.pep_snet.azurerm_subnet.this,
  on .terraform/modules/networking.pep_snet/subnet/main.tf line 23, in resource "azurerm_subnet" "this":
  23:   private_endpoint_network_policies_enabled     = var.private_endpoint_network_policies_enabled

`private_endpoint_network_policies_enabled` will be removed in favour of the
property `private_endpoint_network_policies` in version 4.0 of the AzureRM
Provider

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
